X = -1:.1:1;
T = [-.9602 -.5770 -.0729  .3771  .6405  .6600  .4609 ...
      .1336 -.0013  .0100  .0900  .0100 -.0047  .0988 ...
      .3072  .3960  .3449  .1816 -.0312 -.2189 -.3201];

subplot(2,2,1);
plot(X,T,'+');

x = -3:.1:3;
a = radbas(x);
subplot(2,2,2);
plot(x,a)

a2 = radbas(x-1.5);
a3 = radbas(x+2);
a4 = a + a2*1 + a3*0.5;
subplot(2,2,3);
plot(x,a,'b-',x,a2,'b--',x,a3,'b--',x,a4,'m-')

eg = .001; % среднеквадратичная ошибка
sc = 1; % распространение радиальных базисных функций
net = newrb(X,T,eg,sc);
subplot(2,2,4);
plot(X,T,'+');


X = -1:.01:1;
Y = net(X);

subplot(2,2,4);
hold on;
plot(X,Y);
hold off;
legend({'Цель','Полученное значение'})